{
   "about": "We're a modern four piece acoustic/folk band from around the Berkshire area.\n\nOur YouTube Channel - http://www.youtube.com/user/MartyrsAndKings\n\nFollow us on Twitter -\n\n\u0040MartyrsAndKings\n\nMike - \u0040MikeRGWilliams\nZach - \u0040Zach_Johnsonn\nJames - \u0040JamesHJackman",
   "band_members": "- Mike Williams: Lead Vocals, Guitars\n- Zach Johnson: Guitars\n- Chris Bright: Bass Guitar, Guitars\n- James Jackman: Drums, Percussion",
   "bio": "The band initially started as a two piece consisting of Mike Williams (Vocals, Guitar) and James Jackman (Drums). Both studying at Sandhurst Sixth Form, they spent their spare time rehearsing in the music rooms and before long wanted to take it a step further.\n//\nSoon after came the addition of Chris Bright on bass guitar and Zach Johnson on lead guitar to complete the line up. Here the band spent their time learning and completing songs written by Mike Williams but before long, the songs became far more than the original singer/songwriter feel. The inclusion of Chris' funk bass elements and Zach's melodic lead guitar playing became the modern folk/rock sound the band were looking for.\n//\nAfter spending the rest of 2012 rehearsing and writing new material, it was a year later in April 2013 when the band began playing their first shows. With a warm reception to their sound, the band continued to build on their live show and include as much material, old and new, as they could.\n//\nIt didn't take long for the rest of the band to find their feet when it came to song writing. With involvement from all members the new songs were a step in the right direction.\n//\nSoon after, the band went into the studio in late July to record their first 3-track EP (https://soundcloud.com/martyrs-kings).\n//\nThe rest of the year was spent playing shows and writing new material ready for a second EP early 2014. They also wrote a Facebook bio.\n//\nMK",
   "booking_agent": "MartyrsAndKings\u0040gmail.com",
   "category": "Musician/band",
   "current_location": "Berkshire, UK",
   "genre": "Acoustic, Folk, Singer/Songwriter",
   "hometown": "Sandhurst, Berkshire",
   "influences": "Mike - The National, Jeff Buckley, R.E.M.\n\nZach - The Gaslight Anthem, Frank Turner, Deaf Havana\n\nChris - Red Hot Chili Peppers, Sigur Rós, Florence + the Machine\n\nJames - The National, Biffy Clyro, Dry The River",
   "is_published": true,
   "press_contact": "MartyrsAndKings\u0040gmail.com",
   "record_label": "Unsigned",
   "talking_about_count": 8,
   "username": "MartyrsKings",
   "website": "http://soundcloud.com/martyrs-kings",
   "were_here_count": 0,
   "id": "405413792880935",
   "name": "Martyrs & Kings",
   "link": "https://www.facebook.com/MartyrsKings",
   "likes": 327,
   "cover": {
      "cover_id": 589476924474620,
      "source": "https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-frc3/t1.0-9/s720x720/1506600_589476924474620_764321302_n.jpg",
      "offset_y": 50,
      "offset_x": 0
   }
}